// 1) Создайте переменные с помощью camelCase, snake_case
// и PascalCase и присвойте им значения от 0-я до 3-х.
//     Выведите значения этих переменных на экран
// с помощью метода alert.


//                                 решение
// const userLoginCount = 0;
// const UserLoginCount = 1;
// const user_login_count = 2;
//
// alert(userLoginCount, UserLoginCount,user_login_count );






// 2) Создайте переменные str1='САЛАМ, ' и str2='БИШКЕК!'.
//     С помощью этих переменных выведите на экран фразу
// 'САЛАМ, БИШКЕК!'.



//                                 решение
str1='САЛАМ ';
str2='БИШКЕК!';

alert(str1 + str2)





// 3) Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат
// присвойте переменной c. Затем создайте переменную d, присвойте ей значение 7.
// Сложите переменные c и d, а результат запишите в переменную result.
//     Выведите на экран значение переменной result





//                                 решение
a=17;
b=10;
d=7;
c=a-b;
result=c+d;

alert(result)